## Import library

In [1]:
import pandas as pd
import numpy as np
import mysql.connector
import sqlalchemy as alc
from sqlalchemy import create_engine

### Specifty database

In [98]:
# ini untuk mysql connector
mydb = mysql.connector.connect(
    host ='localhost',
    user = 'root',
    passwd = 'rafdyrizq',
    database = 'world'
)

In [99]:
engine = create_engine('mysql+mysqlconnector://root:rafdyrizq@localhost/world')

In [100]:
mycursor= mydb.cursor()
mycursor.execute('''
select * from country
limit 10;
''')

myresult = mycursor.fetchall()
#myresult
columns = mycursor.column_names
tables = pd.DataFrame(myresult, columns=columns)
tables

,Code,Name,Continent,Region,SurfaceArea,IndepYear,Population,LifeExpectancy,GNP,GNPOld,LocalName,GovernmentForm,HeadOfState,Capital,Code2
0,ABW,Aruba,North America,Caribbean,193.00,NaN,103000,78.4,828.00,793.00,Aruba,Nonmetropolitan Territory of The Netherlands,Beatrix,129,AW
1,AFG,Afghanistan,Asia,Southern and Central Asia,652090.00,1919.0,22720000,45.9,5976.00,None,Afganistan/Afqanestan,Islamic Emirate,Mohammad Omar,1,AF
2,AGO,Angola,Africa,Central Africa,1246700.00,1975.0,12878000,38.3,6648.00,7984.00,Angola,Republic,José Eduardo dos Santos,56,AO
3,AIA,Anguilla,North America,Caribbean,96.00,NaN,8000,76.1,63.20,None,Anguilla,Dependent Territory of the UK,Elisabeth II,62,AI
4,ALB,Albania,Europe,Southern Europe,28748.00,1912.0,3401200,71.6,3205.00,2500.00,Shqipëria,Republic,Rexhep Mejdani,34,AL
5,AND,Andorra,Europe,Southern Europe,468.00,1278.0,78000,83.5,1630.00,None,Andorra,Parliamentary Coprincipality,,55,AD
6,ANT,Netherlands Antilles,North America,Caribbean,800.00,NaN,217000,74.7,1941.00,None,Nederlandse Antillen,Nonmetropolitan Territory of The Netherlands,Beatrix,33,AN
7,ARE,United Arab Emirates,Asia,Middle East,83600.00,1971.0,2441000,74.1,37966.00,36846.00,Al-Imarat al-´Arabiya al-Muttahida,Emirate Federation,Zayid bin Sultan al-Nahayan,65,AE
8,ARG,Argentina,South America,South America,2780400.00,1816.0,37032000,75.1,340238.00,323310.00,Argentina,Federal Republic,Fernando de la Rúa,69,AR
9,ARM,Armenia,Asia,Middle East,29800.00,1991.0,3520000,66.4,1813.00,1627.00,Hajastan,Republic,Robert Kotšarjan,126,AM

## Ada berapa negara di data world?

In [74]:
query = '''
select count(name) from country 
;'''
pd.read_sql_query(query, engine)

   count(name)
0          239

In [75]:
query = '''
select count(name) from country where continent = 'Africa'
;'''
pd.read_sql_query(query, engine)

   count(name)
0           58

In [76]:
query = '''
select continent, count(name) from country
group by continent
having count(name) > (select count(name) from country where continent = 'North America' )
;'''
pd.read_sql_query(query,engine)

  continent  count(name)
0      Asia           51
1    Africa           58
2    Europe           46

## Tampilkan rata-rata harapan hidup berdasarkan benua

In [7]:
query = '''
select continent, avg(lifeexpectancy) as average_life_expectancy from country
group by continent;
'''
pd.read_sql_query(query,engine)

       continent  average_life_expectancy
0  North America                 72.99189
1           Asia                 67.44118
2         Africa                 52.57193
3         Europe                 75.14773
4  South America                 70.94615
5        Oceania                 69.71500
6     Antarctica                      NaN

## Tampilkan Jumlah region di masing-masing benua

In [77]:
query='''
select
continent,
count(distinct(region)) as jumlah_region

from country

group by continent
;
'''
pd.read_sql_query(query,engine)

       continent  jumlah_region
0           Asia              4
1         Europe              6
2  North America              3
3         Africa              5
4        Oceania              5
5     Antarctica              1
6  South America              1

In [94]:
query = '''
select count(distinct(region)) from country 
group by continent 
having continent='Asia'
;'''
pd.read_sql_query(query,engine)

   count(distinct(region))
0                        4

In [108]:
query='''
select count(distinct(region)), continent from country
where continent like 'a%'
group by continent 

having count(distinct(region)) > (select count(distinct(region)) from country 
group by continent 
having continent='Asia')

;'''
pd.read_sql_query(query, engine)

   count(distinct(region)) continent
0                        5    Africa

## Tampilkan rata-rata GNP di Afrika berdasarkan regionnya

In [9]:
query = '''
select region, avg(GNP) as average_GNP from country
where continent='Africa'
group by region;
'''
pd.read_sql_query(query,engine)

            region   average_GNP
0   Central Africa   3659.777778
1   Eastern Africa   3496.250000
2   Western Africa   6277.117647
3  Southern Africa  25386.200000
4  Northern Africa  34838.571429

## Tampilkan negara di Eropa yang memiliki nama dimulai dari huruf I

In [10]:
query='''
select name as negara from country
where name like'I%'
and continent='Europe';
'''
pd.read_sql_query(query,engine)

    negara
0  Ireland
1  Iceland
2    Italy

In [115]:
query='''
select name, continent from country
where name like'i%'
and continent='Europe'
;'''
pd.read_sql_query(query, engine)

      name continent
0  Ireland    Europe
1  Iceland    Europe
2    Italy    Europe

## Ada berapa bahasa unik di dunia?

In [11]:
query='''
select count(distinct(language)) as jumlah_bahasa from countrylanguage;
'''
pd.read_sql_query(query,engine)

   jumlah_bahasa
0            457

## Tampilkan 10 negara dengan GNP di atas rata-rata GNP negara-negara di benua Oceania, diurutkan dari yang terbesar

In [12]:
query='''
select name as negara, GNP 
from country
where GNP>(select avg(continent) from country where continent='Oceania')
order by GNP desc
limit 10
;
'''
pd.read_sql_query(query,engine)

           negara        GNP
0   United States  8510700.0
1           Japan  3787042.0
2         Germany  2133367.0
3          France  1424285.0
4  United Kingdom  1378330.0
5           Italy  1161755.0
6           China   982268.0
7          Brazil   776739.0
8          Canada   598862.0
9           Spain   553233.0

In [119]:
query='''
select continent, avg(GNP) from country
group by continent
having continent='Oceania'
;'''
pd.read_sql_query(query, engine)

  continent      avg(GNP)
0   Oceania  14991.953571

In [123]:
query='''
select name, GNP from country
;'''
pd.read_sql_query(query, engine)

             name       GNP
0           Aruba     828.0
1     Afghanistan    5976.0
2          Angola    6648.0
3        Anguilla      63.2
4         Albania    3205.0
..            ...       ...
234         Yemen    6041.0
235    Yugoslavia   17000.0
236  South Africa  116729.0
237        Zambia    3377.0
238      Zimbabwe    5951.0

[239 rows x 2 columns]

In [127]:
query='''
select name, GNP from country

where GNP > (select avg(GNP) from country
group by continent
having continent='Oceania')

order by GNP desc
limit 5
;'''
pd.read_sql_query(query, engine)

             name        GNP
0   United States  8510700.0
1           Japan  3787042.0
2         Germany  2133367.0
3          France  1424285.0
4  United Kingdom  1378330.0

## Tampikan GNP negara belanda, ibukota beserta populasi dari ibukotanya

In [13]:
query='''
select country.Name as negara, country.GNP, city.Name as capital, country.population

from country, city
where country.name='Netherlands' 
and country.code=city.countrycode
group by country.Name
;
'''
pd.read_sql_query(query,engine)

        negara       GNP    capital  population
0  Netherlands  371362.0  Amsterdam    15864000

In [128]:
query='''
select country.Name as negara, country.GNP, city.Name as capital, country.population

from country, city
where country.code=city.countrycode
and country.name='Netherlands' 

group by country.Name
;
'''
pd.read_sql_query(query,engine)

        negara       GNP    capital  population
0  Netherlands  371362.0  Amsterdam    15864000

## 10 negara mana yang memiliki persentase pemakai bahasa spanyol paling tinggi

In [14]:
query='''
select c.name as negara, cl.percentage as persentase
from country c, countrylanguage cl
where c.code =cl.countrycode
and cl.language='Spanish'
order by cl.percentage desc
limit 10
;
'''
pd.read_sql_query(query,engine)

               negara  persentase
0                Cuba       100.0
1         El Salvador       100.0
2            Colombia        99.0
3  Dominican Republic        98.0
4           Nicaragua        97.6
5          Costa Rica        97.5
6            Honduras        97.2
7           Venezuela        96.9
8           Argentina        96.8
9             Uruguay        95.7

## Tampikan GNP negara Indonesia, ibukota, populasi dari ibukotanya dan bahasa resmi yang dipakai

In [15]:
# menggunakan implicite join
query='''
select 
c.name as negara,
c.GNP,
city.name as ibu_kota,
city.population as populasi,
cl.language

from country c, city, countrylanguage cl

where city.countrycode=c.code and c.code=cl.countrycode
and c.name='Indonesia'
and cl.isofficial ='T'
and c.capital=city.ID
;
'''
pd.read_sql_query(query,engine)

      negara      GNP ibu_kota  populasi language
0  Indonesia  84982.0  Jakarta   9604900    Malay

In [135]:
query='''
select 
c.name as negara,
c.GNP,
city.name as ibu_kota,
city.population as populasi,
cl.language

from country c, city, countrylanguage cl
where city.countrycode=c.code and c.code=cl.countrycode
and c.name='Indonesia'
and cl.isofficial ='T'
and c.capital=city.ID
;
'''
pd.read_sql_query(query,engine)

      negara      GNP ibu_kota  populasi language
0  Indonesia  84982.0  Jakarta   9604900    Malay

In [16]:
# menggunakan inner join
query='''
select 
country.name as negara,
country.GNP,
city.name as ibu_kota,
city.population as populasi,
countrylanguage.language

from country join city 
on country.code=city.countrycode
join countrylanguage 
on country.code=countrylanguage.countrycode

where country.name='Indonesia'
and countrylanguage.isofficial ='T'
and country.capital=city.ID
;
'''
pd.read_sql_query(query,engine)

      negara      GNP ibu_kota  populasi language
0  Indonesia  84982.0  Jakarta   9604900    Malay